In [2]:
import pandas as pd
import numpy as np
df=pd.read_csv("data.csv")
df

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y
1   John             C        N              85             51           Y
2   Paul             F        N              10             17           N
3  David             B        Y              75             60           Y
4  Trent             E        N              20             30           Y
5  Shane             A        Y              60             70           Y
6   Kira             B        Y              85             68           N

In [3]:
df.head()

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y
1   John             C        N              85             51           Y
2   Paul             F        N              10             17           N
3  David             B        Y              75             60           Y
4  Trent             E        N              20             30           Y

In [4]:
df.head(2)

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y
1   John             C        N              85             51           Y

In [5]:
df.tail()

    Name Overall Grade Obedient  Research score  Project score Recommended
2   Paul             F        N              10             17           N
3  David             B        Y              75             60           Y
4  Trent             E        N              20             30           Y
5  Shane             A        Y              60             70           Y
6   Kira             B        Y              85             68           N

In [6]:
df.tail(3)

    Name Overall Grade Obedient  Research score  Project score Recommended
4  Trent             E        N              20             30           Y
5  Shane             A        Y              60             70           Y
6   Kira             B        Y              85             68           N

In [7]:
df.describe()

       Research score  Project score
count        7.000000       7.000000
mean        60.714286      54.428571
std         32.841611      23.810762
min         10.000000      17.000000
25%         40.000000      40.500000
50%         75.000000      60.000000
75%         85.000000      69.000000
max         90.000000      85.000000

In [8]:
df.quantile(.45)

C:\Users\saich\AppData\Local\Temp\ipykernel_13944\1382251409.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.quantile(.45)

Research score    70.5
Project score     57.3
Name: 0.45, dtype: float64

In [9]:
df.describe(include='all')

,Name,Overall Grade,Obedient,Research score,Project score,Recommended
count,7,7,7,7.000000,7.000000,7
unique,7,5,2,NaN,NaN,2
top,Henry,A,Y,NaN,NaN,Y
freq,1,2,4,NaN,NaN,5
mean,NaN,NaN,NaN,60.714286,54.428571,NaN
std,NaN,NaN,NaN,32.841611,23.810762,NaN
min,NaN,NaN,NaN,10.000000,17.000000,NaN
25%,NaN,NaN,NaN,40.000000,40.500000,NaN
50%,NaN,NaN,NaN,75.000000,60.000000,NaN
75%,NaN,NaN,NaN,85.000000,69.000000,NaN
max,NaN,NaN,NaN,90.000000,85.000000,NaN

In [10]:
df.Name

0    Henry
1     John
2     Paul
3    David
4    Trent
5    Shane
6     Kira
Name: Name, dtype: object

In [13]:
df['Name']

0    Henry
1     John
2     Paul
3    David
4    Trent
5    Shane
6     Kira
Name: Name, dtype: object

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
type(df.Name)

pandas.core.series.Series

In [16]:
#When you want to print two or more columns

In [19]:
df[['Name','Overall Grade']]

    Name Overall Grade
0  Henry             A
1   John             C
2   Paul             F
3  David             B
4  Trent             E
5  Shane             A
6   Kira             B

In [21]:
df['Overall Grade'].unique()

array(['A', 'C', 'F', 'B', 'E'], dtype=object)

In [22]:
df['Project score'].value_counts(normalize=True)

85    0.142857
51    0.142857
17    0.142857
60    0.142857
30    0.142857
70    0.142857
68    0.142857
Name: Project score, dtype: float64

In [23]:
df['Overall Grade'].value_counts(normalize=True)

A    0.285714
B    0.285714
C    0.142857
F    0.142857
E    0.142857
Name: Overall Grade, dtype: float64

In [24]:
df.iloc[::]

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y
1   John             C        N              85             51           Y
2   Paul             F        N              10             17           N
3  David             B        Y              75             60           Y
4  Trent             E        N              20             30           Y
5  Shane             A        Y              60             70           Y
6   Kira             B        Y              85             68           N

In [25]:
df.iloc[:,0]

0    Henry
1     John
2     Paul
3    David
4    Trent
5    Shane
6     Kira
Name: Name, dtype: object

In [26]:
df.iloc[0,:]

Name              Henry
Overall Grade         A
Obedient              Y
Research score       90
Project score        85
Recommended           Y
Name: 0, dtype: object

In [27]:
df.iloc[:5,:2]

    Name Overall Grade
0  Henry             A
1   John             C
2   Paul             F
3  David             B
4  Trent             E

In [28]:
df[df['Project score']>60]

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y
5  Shane             A        Y              60             70           Y
6   Kira             B        Y              85             68           N

In [39]:
df[df['Project score']>60] & df[df['Research score']>70]

TypeError: unsupported operand type(s) for &: 'float' and 'float'

In [44]:
df[ (df['Research score']>60 ) & (df['Project score']>70 ) ]

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y

In [50]:
df[ (df['Research score']>60 ) & (df['Project score']>70 ) ][df['Name'].str.startswith('H')]

C:\Users\saich\AppData\Local\Temp\ipykernel_13944\4276625349.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[ (df['Research score']>60 ) & (df['Project score']>70 ) ][df['Name'].str.startswith('H')]

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y

In [52]:
df.drop(5)

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y
1   John             C        N              85             51           Y
2   Paul             F        N              10             17           N
3  David             B        Y              75             60           Y
4  Trent             E        N              20             30           Y
6   Kira             B        Y              85             68           N

In [53]:
df

    Name Overall Grade Obedient  Research score  Project score Recommended
0  Henry             A        Y              90             85           Y
1   John             C        N              85             51           Y
2   Paul             F        N              10             17           N
3  David             B        Y              75             60           Y
4  Trent             E        N              20             30           Y
5  Shane             A        Y              60             70           Y
6   Kira             B        Y              85             68           N

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Overall Grade   7 non-null      object
 2   Obedient        7 non-null      object
 3   Research score  7 non-null      int64
 4   Project score   7 non-null      int64
 5   Recommended     7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes